#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

[command]/home/runner/work/_temp/ba7f0ce6-365f-40fd-b6c2-3bd425b2a91c/terraform-bin plan
[0m[33mRunning plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.[0m

Preparing the remote plan...
[0m
[0m[33mTo view this run in a browser, visit:
https://app.terraform.io/app/Cataprato/cataprato-workspace/runs/run-QKkP7PqisECEK53x[0m
[0m
Waiting for the plan to start...

Terraform v1.5.3
on linux_amd64
Initializing plugins and modules...
[1mmodule.lambda_function.data.external.archive_prepare[0]: Refreshing...[0m[0m
[1mmodule.lambda_layer_s3.data.external.archive_prepare[0]: Refreshing...[0m[0m
[1mmodule.lambda_function.data.external.archive_prepare[0]: Refresh complete after 0s [id=-][0m[0m
[1mmodule.lambda_layer_s3.data.external.archive_prepare[0]: Refresh complete after 0s [id=-][0m[0m
[1mmodule.s3_bucket.data.aws_region.current: Refreshing...[0m[0m
[1mmodule.s3_bucket.data.aws_canonical_user_id.this: Refreshing...[0m[0m
[1mmodule.lambda_layer_s3.data.aws_region.current: Refreshing...[0m[0m
[1mmodule.lambda.aws_lambda_function.this: Refreshing state... [id=lambda_function_name][0m[0m
[1mdata.aws_organizations_organization.this: Refreshing...[0m[0m
[1mmodule.s3_bucket.data.aws_partition.current: Refreshing...[0m[0m
[1mmodule.s3_bucket.data.aws_caller_identity.current: Refreshing...[0m[0m
[1mmodule.lambda_function.data.aws_region.current: Refreshing...[0m[0m
[1mmodule.s3_bucket.data.aws_region.current: Refresh complete after 0s [id=us-east-1][0m[0m
[1mdata.aws_caller_identity.current: Refreshing...[0m[0m
[1mmodule.s3_bucket.data.aws_partition.current: Refresh complete after 0s [id=aws][0m[0m
[1mmodule.lambda_function.data.aws_caller_identity.current: Refreshing...[0m[0m
[1mmodule.lambda_function.data.aws_region.current: Refresh complete after 0s [id=us-east-1][0m[0m
[1mmodule.lambda_layer_s3.data.aws_partition.current: Refreshing...[0m[0m
[1mmodule.lambda_layer_s3.data.aws_region.current: Refresh complete after 0s [id=us-east-1][0m[0m
[1mmodule.lambda_layer_s3.data.aws_partition.current: Refresh complete after 0s [id=aws][0m[0m
[1mmodule.lambda_layer_s3.data.aws_caller_identity.current: Refreshing...[0m[0m
[1mmodule.lambda_function.data.aws_partition.current: Refreshing...[0m[0m
[1mmodule.lambda_function.data.aws_partition.current: Refresh complete after 0s [id=aws][0m[0m
[1mmodule.lambda_function.data.aws_iam_policy_document.assume_role[0]: Refreshing...[0m[0m
[1mmodule.lambda_function.data.aws_iam_policy_document.assume_role[0]: Refresh complete after 0s [id=2690255455][0m[0m
[1mmodule.s3_bucket.data.aws_caller_identity.current: Refresh complete after 0s [id=350131064538][0m[0m
[1mdata.aws_caller_identity.current: Refresh complete after 0s [id=350131064538][0m[0m
[1mmodule.lambda_function.data.aws_caller_identity.current: Refresh complete after 0s [id=350131064538][0m[0m
[1mmodule.lambda_layer_s3.data.aws_caller_identity.current: Refresh complete after 0s [id=350131064538][0m[0m
[1mmodule.s3_bucket.data.aws_canonical_user_id.this: Refresh complete after 0s [id=c20555c7d3c8cb7cec2fd9dacdea0f908ba112c4d5934db79995f4ddc3c36ede][0m[0m
[1mdata.aws_organizations_organization.this: Refresh complete after 0s [id=o-w0iv42zpgi][0m[0m
[1mmodule.lambda.aws_lambda_function.this: Drift detected (update)[0m[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [31m-[0m destroy[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # random_pet.this[0m will be created
[0m  [32m+[0m[0m resource "random_pet" "this" {
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m length    = 2
      [32m+[0m[0m separator = "-"
    }

[1m  # module.lambda.aws_lambda_function.this[0m will be [1m[31mdestroyed[0m
[0m  [31m-[0m[0m resource "aws_lambda_function" "this" {
      [31m-[0m[0m architectures                  = [
          [31m-[0m[0m "x86_64",
        ] [90m-> null[0m[0m
      [31m-[0m[0m arn                            = "arn:aws:lambda:us-east-1:350131064538:function:lambda_function_name" [90m-> null[0m[0m
      [31m-[0m[0m filename                       = "dist.zip" [90m-> null[0m[0m
      [31m-[0m[0m function_name                  = "lambda_function_name" [90m-> null[0m[0m
      [31m-[0m[0m handler                        = "dist/lambda" [90m-> null[0m[0m
      [31m-[0m[0m id                             = "lambda_function_name" [90m-> null[0m[0m
      [31m-[0m[0m invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:lambda_function_name/invocations" [90m-> null[0m[0m
      [31m-[0m[0m last_modified                  = "2023-08-01T23:54:01.608+0000" [90m-> null[0m[0m
      [31m-[0m[0m layers                         = [] [90m-> null[0m[0m
      [31m-[0m[0m memory_size                    = 128 [90m-> null[0m[0m
      [31m-[0m[0m package_type                   = "Zip" [90m-> null[0m[0m
      [31m-[0m[0m publish                        = false [90m-> null[0m[0m
      [31m-[0m[0m qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:lambda_function_name:$LATEST" [90m-> null[0m[0m
      [31m-[0m[0m qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:lambda_function_name:$LATEST/invocations" [90m-> null[0m[0m
      [31m-[0m[0m reserved_concurrent_executions = -1 [90m-> null[0m[0m
      [31m-[0m[0m role                           = "arn:aws:iam::350131064538:role/service-role/cataprato-role-0cqzd0zs" [90m-> null[0m[0m
      [31m-[0m[0m runtime                        = "nodejs18.x" [90m-> null[0m[0m
      [31m-[0m[0m skip_destroy                   = false [90m-> null[0m[0m
      [31m-[0m[0m source_code_hash               = "z62MskzEmjQL5by6KnALmCUBjKmLlhoNG718aWGySk4=" [90m-> null[0m[0m
      [31m-[0m[0m source_code_size               = 2125 [90m-> null[0m[0m
      [31m-[0m[0m tags                           = {} [90m-> null[0m[0m
      [31m-[0m[0m tags_all                       = {} [90m-> null[0m[0m
      [31m-[0m[0m timeout                        = 3 [90m-> null[0m[0m
      [31m-[0m[0m version                        = "$LATEST" [90m-> null[0m[0m

      [31m-[0m[0m ephemeral_storage {
          [31m-[0m[0m size = 512 [90m-> null[0m[0m
        }

      [31m-[0m[0m tracing_config {
          [31m-[0m[0m mode = "PassThrough" [90m-> null[0m[0m
        }
    }

[1m  # module.lambda_function.data.aws_iam_policy_document.logs[0][0m will be read during apply
[0m [36m<=[0m[0m data "aws_iam_policy_document" "logs" {
      [32m+[0m[0m id   = (known after apply)
      [32m+[0m[0m json = (known after apply)

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "logs:CreateLogGroup",
              [32m+[0m[0m "logs:CreateLogStream",
              [32m+[0m[0m "logs:PutLogEvents",
            ]
          [32m+[0m[0m effect    = "Allow"
          [32m+[0m[0m resources = (known after apply)
        }
    }

[1m  # module.lambda_function.aws_cloudwatch_log_group.lambda[0][0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "lambda" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m name              = "/aws/lambda/cataprato-core-lambda"
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 0
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags_all          = (known after apply)
    }

[1m  # module.lambda_function.aws_iam_policy.logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "logs" {
      [32m+[0m[0m arn         = (known after apply)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = "cataprato-core-lambda-logs"
      [32m+[0m[0m name_prefix = (known after apply)
      [32m+[0m[0m path        = "/tf-managed/"
      [32m+[0m[0m policy      = (known after apply)
      [32m+[0m[0m policy_id   = (known after apply)
      [32m+[0m[0m tags_all    = (known after apply)
    }

[1m  # module.lambda_function.aws_iam_role.lambda[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "lambda" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = true
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "cataprato-core-lambda"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/tf-managed/"
      [32m+[0m[0m tags_all              = (known after apply)
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.lambda_function.aws_iam_role_policy_attachment.logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "logs" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = "cataprato-core-lambda"
    }

[1m  # module.lambda_function.aws_lambda_function.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_function" "this" {
      [32m+[0m[0m architectures                  = [
          [32m+[0m[0m "x86_64",
        ]
      [32m+[0m[0m arn                            = (known after apply)
      [32m+[0m[0m description                    = "Cataprato core"
      [32m+[0m[0m function_name                  = "cataprato-core-lambda"
      [32m+[0m[0m handler                        = "lambda.handler"
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m invoke_arn                     = (known after apply)
      [32m+[0m[0m last_modified                  = (known after apply)
      [32m+[0m[0m layers                         = (known after apply)
      [32m+[0m[0m memory_size                    = 128
      [32m+[0m[0m package_type                   = "Zip"
      [32m+[0m[0m publish                        = true
      [32m+[0m[0m qualified_arn                  = (known after apply)
      [32m+[0m[0m qualified_invoke_arn           = (known after apply)
      [32m+[0m[0m reserved_concurrent_executions = -1
      [32m+[0m[0m role                           = (known after apply)
      [32m+[0m[0m runtime                        = "nodejs18.x"
      [32m+[0m[0m s3_bucket                      = (known after apply)
      [32m+[0m[0m s3_key                         = "lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"
      [32m+[0m[0m s3_object_version              = (known after apply)
      [32m+[0m[0m signing_job_arn                = (known after apply)
      [32m+[0m[0m signing_profile_version_arn    = (known after apply)
      [32m+[0m[0m skip_destroy                   = false
      [32m+[0m[0m source_code_hash               = (known after apply)
      [32m+[0m[0m source_code_size               = (known after apply)
      [32m+[0m[0m tags_all                       = (known after apply)
      [32m+[0m[0m timeout                        = 3
      [32m+[0m[0m version                        = (known after apply)

      [32m+[0m[0m ephemeral_storage {
          [32m+[0m[0m size = 512
        }

      [32m+[0m[0m timeouts {
          [32m+[0m[0m create = "20m"
          [32m+[0m[0m delete = "20m"
          [32m+[0m[0m update = "20m"
        }
    }

[1m  # module.lambda_function.aws_lambda_function_url.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_function_url" "this" {
      [32m+[0m[0m authorization_type = "AWS_IAM"
      [32m+[0m[0m function_arn       = (known after apply)
      [32m+[0m[0m function_name      = "cataprato-core-lambda"
      [32m+[0m[0m function_url       = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m invoke_mode        = "RESPONSE_STREAM"
      [32m+[0m[0m url_id             = (known after apply)

      [32m+[0m[0m cors {
          [32m+[0m[0m allow_credentials = true
          [32m+[0m[0m allow_headers     = [
              [32m+[0m[0m "date",
              [32m+[0m[0m "keep-alive",
            ]
          [32m+[0m[0m allow_methods     = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m allow_origins     = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m expose_headers    = [
              [32m+[0m[0m "date",
              [32m+[0m[0m "keep-alive",
            ]
          [32m+[0m[0m max_age           = 86400
        }
    }

[1m  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "current_version_triggers" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = "cataprato-core-lambda"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "apigateway.amazonaws.com"
      [32m+[0m[0m qualifier           = (known after apply)
      [32m+[0m[0m source_arn          = "arn:aws:execute-api:us-east-1:350131064538:aqnku8akd0/*/*/*"
      [32m+[0m[0m statement_id        = "APIGatewayAny"
      [32m+[0m[0m statement_id_prefix = (known after apply)
    }

[1m  # module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["APIGatewayAny"][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "unqualified_alias_triggers" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = "cataprato-core-lambda"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "apigateway.amazonaws.com"
      [32m+[0m[0m source_arn          = "arn:aws:execute-api:us-east-1:350131064538:aqnku8akd0/*/*/*"
      [32m+[0m[0m statement_id        = "APIGatewayAny"
      [32m+[0m[0m statement_id_prefix = (known after apply)
    }

[1m  # module.lambda_function.aws_s3_object.lambda_package[0][0m will be created
[0m  [32m+[0m[0m resource "aws_s3_object" "lambda_package" {
      [32m+[0m[0m acl                    = "private"
      [32m+[0m[0m bucket                 = (known after apply)
      [32m+[0m[0m bucket_key_enabled     = (known after apply)
      [32m+[0m[0m content_type           = (known after apply)
      [32m+[0m[0m etag                   = (known after apply)
      [32m+[0m[0m force_destroy          = false
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m key                    = "lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"
      [32m+[0m[0m kms_key_id             = (known after apply)
      [32m+[0m[0m server_side_encryption = (known after apply)
      [32m+[0m[0m source                 = "./.terraform/lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"
      [32m+[0m[0m storage_class          = "ONEZONE_IA"
      [32m+[0m[0m tags_all               = (known after apply)
      [32m+[0m[0m version_id             = (known after apply)
    }

[1m  # module.lambda_function.local_file.archive_plan[0][0m will be created
[0m  [32m+[0m[0m resource "local_file" "archive_plan" {
      [32m+[0m[0m content              = jsonencode(
            {
              [32m+[0m[0m artifacts_dir = "./.terraform/lambda-builds/"
              [32m+[0m[0m build_plan    = [
                  [32m+[0m[0m [
                      [32m+[0m[0m "zip",
                      [32m+[0m[0m "./dist/lambda.js",
                      [32m+[0m[0m [90mnull[0m[0m,
                    ],
                ]
              [32m+[0m[0m filename      = "./.terraform/lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"
              [32m+[0m[0m runtime       = "nodejs18.x"
            }
        )
      [32m+[0m[0m content_base64sha256 = (known after apply)
      [32m+[0m[0m content_base64sha512 = (known after apply)
      [32m+[0m[0m content_md5          = (known after apply)
      [32m+[0m[0m content_sha1         = (known after apply)
      [32m+[0m[0m content_sha256       = (known after apply)
      [32m+[0m[0m content_sha512       = (known after apply)
      [32m+[0m[0m directory_permission = "0755"
      [32m+[0m[0m file_permission      = "0644"
      [32m+[0m[0m filename             = "./.terraform/lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.plan.json"
      [32m+[0m[0m id                   = (known after apply)
    }

[1m  # module.lambda_function.null_resource.archive[0][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "archive" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "filename"  = "./.terraform/lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"
          [32m+[0m[0m "timestamp" = "1691190368371745200"
        }
    }

[1m  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "sam_metadata_aws_lambda_function" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "built_output_path"    = "./.terraform/lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"
          [32m+[0m[0m "original_source_code" = ""./dist/lambda.js""
          [32m+[0m[0m "resource_name"        = "aws_lambda_function.this[0]"
          [32m+[0m[0m "resource_type"        = "ZIP_LAMBDA_FUNCTION"
          [32m+[0m[0m "source_code_property" = "path"
        }
    }

[1m  # module.lambda_layer_s3.aws_lambda_layer_version.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_layer_version" "this" {
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m compatible_runtimes         = [
          [32m+[0m[0m "nodejs18.x",
        ]
      [32m+[0m[0m created_date                = (known after apply)
      [32m+[0m[0m description                 = "Node_modules layer"
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m layer_arn                   = (known after apply)
      [32m+[0m[0m layer_name                  = "cataprato-core-layer-s3"
      [32m+[0m[0m s3_bucket                   = (known after apply)
      [32m+[0m[0m s3_key                      = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"
      [32m+[0m[0m s3_object_version           = (known after apply)
      [32m+[0m[0m signing_job_arn             = (known after apply)
      [32m+[0m[0m signing_profile_version_arn = (known after apply)
      [32m+[0m[0m skip_destroy                = false
      [32m+[0m[0m source_code_hash            = (known after apply)
      [32m+[0m[0m source_code_size            = (known after apply)
      [32m+[0m[0m version                     = (known after apply)
    }

[1m  # module.lambda_layer_s3.aws_s3_object.lambda_package[0][0m will be created
[0m  [32m+[0m[0m resource "aws_s3_object" "lambda_package" {
      [32m+[0m[0m acl                    = "private"
      [32m+[0m[0m bucket                 = (known after apply)
      [32m+[0m[0m bucket_key_enabled     = (known after apply)
      [32m+[0m[0m content_type           = (known after apply)
      [32m+[0m[0m etag                   = (known after apply)
      [32m+[0m[0m force_destroy          = false
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m key                    = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"
      [32m+[0m[0m kms_key_id             = (known after apply)
      [32m+[0m[0m server_side_encryption = (known after apply)
      [32m+[0m[0m source                 = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"
      [32m+[0m[0m storage_class          = "ONEZONE_IA"
      [32m+[0m[0m tags_all               = (known after apply)
      [32m+[0m[0m version_id             = (known after apply)
    }

[1m  # module.lambda_layer_s3.local_file.archive_plan[0][0m will be created
[0m  [32m+[0m[0m resource "local_file" "archive_plan" {
      [32m+[0m[0m content              = jsonencode(
            {
              [32m+[0m[0m artifacts_dir = "builds"
              [32m+[0m[0m build_plan    = [
                  [32m+[0m[0m [
                      [32m+[0m[0m "zip",
                      [32m+[0m[0m "./dist",
                      [32m+[0m[0m [90mnull[0m[0m,
                    ],
                ]
              [32m+[0m[0m filename      = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"
              [32m+[0m[0m runtime       = ""
            }
        )
      [32m+[0m[0m content_base64sha256 = (known after apply)
      [32m+[0m[0m content_base64sha512 = (known after apply)
      [32m+[0m[0m content_md5          = (known after apply)
      [32m+[0m[0m content_sha1         = (known after apply)
      [32m+[0m[0m content_sha256       = (known after apply)
      [32m+[0m[0m content_sha512       = (known after apply)
      [32m+[0m[0m directory_permission = "0755"
      [32m+[0m[0m file_permission      = "0644"
      [32m+[0m[0m filename             = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.plan.json"
      [32m+[0m[0m id                   = (known after apply)
    }

[1m  # module.lambda_layer_s3.null_resource.archive[0][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "archive" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "filename"  = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"
          [32m+[0m[0m "timestamp" = "1691190368389314800"
        }
    }

[1m  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "built_output_path"    = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"
          [32m+[0m[0m "original_source_code" = ""./dist""
          [32m+[0m[0m "resource_name"        = "aws_lambda_layer_version.this[0]"
          [32m+[0m[0m "resource_type"        = "LAMBDA_LAYER"
          [32m+[0m[0m "source_code_property" = "path"
        }
    }

[1m  # module.s3_bucket.aws_s3_bucket.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket" "this" {
      [32m+[0m[0m acceleration_status         = (known after apply)
      [32m+[0m[0m acl                         = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m bucket                      = (known after apply)
      [32m+[0m[0m bucket_domain_name          = (known after apply)
      [32m+[0m[0m bucket_prefix               = (known after apply)
      [32m+[0m[0m bucket_regional_domain_name = (known after apply)
      [32m+[0m[0m force_destroy               = true
      [32m+[0m[0m hosted_zone_id              = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m object_lock_enabled         = false
      [32m+[0m[0m policy                      = (known after apply)
      [32m+[0m[0m region                      = (known after apply)
      [32m+[0m[0m request_payer               = (known after apply)
      [32m+[0m[0m tags_all                    = (known after apply)
      [32m+[0m[0m website_domain              = (known after apply)
      [32m+[0m[0m website_endpoint            = (known after apply)
    }

[1m  # module.s3_bucket.aws_s3_bucket_public_access_block.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket_public_access_block" "this" {
      [32m+[0m[0m block_public_acls       = true
      [32m+[0m[0m block_public_policy     = true
      [32m+[0m[0m bucket                  = (known after apply)
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ignore_public_acls      = true
      [32m+[0m[0m restrict_public_buckets = true
    }

[1m  # module.s3_bucket.aws_s3_bucket_versioning.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket_versioning" "this" {
      [32m+[0m[0m bucket = (known after apply)
      [32m+[0m[0m id     = (known after apply)

      [32m+[0m[0m versioning_configuration {
          [32m+[0m[0m mfa_delete = (known after apply)
          [32m+[0m[0m status     = "Enabled"
        }
    }

[1mPlan:[0m 21 to add, 0 to change, 1 to destroy.
[0m
------------------------------------------------------------------------

[1mCost Estimation:
[0m
Resources: 0 of 6 estimated
           $0.0/mo +$0.0
::debug::Terraform exited with code 0.
::debug::stdout: [0m[33mRunning plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C%0Awill stop streaming the logs, but will not stop the plan running remotely.[0m%0A%0APreparing the remote plan...%0A[0m%0A[0m[33mTo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/Cataprato/cataprato-workspace/runs/run-QKkP7PqisECEK53x[0m%0A[0m%0AWaiting for the plan to start...%0A%0ATerraform v1.5.3%0Aon linux_amd64%0AInitializing plugins and modules...%0A[1mmodule.lambda_function.data.external.archive_prepare[0]: Refreshing...[0m[0m%0A[1mmodule.lambda_layer_s3.data.external.archive_prepare[0]: Refreshing...[0m[0m%0A[1mmodule.lambda_function.data.external.archive_prepare[0]: Refresh complete after 0s [id=-][0m[0m%0A[1mmodule.lambda_layer_s3.data.external.archive_prepare[0]: Refresh complete after 0s [id=-][0m[0m%0A[1mmodule.s3_bucket.data.aws_region.current: Refreshing...[0m[0m%0A[1mmodule.s3_bucket.data.aws_canonical_user_id.this: Refreshing...[0m[0m%0A[1mmodule.lambda_layer_s3.data.aws_region.current: Refreshing...[0m[0m%0A[1mmodule.lambda.aws_lambda_function.this: Refreshing state... [id=lambda_function_name][0m[0m%0A[1mdata.aws_organizations_organization.this: Refreshing...[0m[0m%0A[1mmodule.s3_bucket.data.aws_partition.current: Refreshing...[0m[0m%0A[1mmodule.s3_bucket.data.aws_caller_identity.current: Refreshing...[0m[0m%0A[1mmodule.lambda_function.data.aws_region.current: Refreshing...[0m[0m%0A[1mmodule.s3_bucket.data.aws_region.current: Refresh complete after 0s [id=us-east-1][0m[0m%0A[1mdata.aws_caller_identity.current: Refreshing...[0m[0m%0A[1mmodule.s3_bucket.data.aws_partition.current: Refresh complete after 0s [id=aws][0m[0m%0A[1mmodule.lambda_function.data.aws_caller_identity.current: Refreshing...[0m[0m%0A[1mmodule.lambda_function.data.aws_region.current: Refresh complete after 0s [id=us-east-1][0m[0m%0A[1mmodule.lambda_layer_s3.data.aws_partition.current: Refreshing...[0m[0m%0A[1mmodule.lambda_layer_s3.data.aws_region.current: Refresh complete after 0s [id=us-east-1][0m[0m%0A[1mmodule.lambda_layer_s3.data.aws_partition.current: Refresh complete after 0s [id=aws][0m[0m%0A[1mmodule.lambda_layer_s3.data.aws_caller_identity.current: Refreshing...[0m[0m%0A[1mmodule.lambda_function.data.aws_partition.current: Refreshing...[0m[0m%0A[1mmodule.lambda_function.data.aws_partition.current: Refresh complete after 0s [id=aws][0m[0m%0A[1mmodule.lambda_function.data.aws_iam_policy_document.assume_role[0]: Refreshing...[0m[0m%0A[1mmodule.lambda_function.data.aws_iam_policy_document.assume_role[0]: Refresh complete after 0s [id=2690255455][0m[0m%0A[1mmodule.s3_bucket.data.aws_caller_identity.current: Refresh complete after 0s [id=350131064538][0m[0m%0A[1mdata.aws_caller_identity.current: Refresh complete after 0s [id=350131064538][0m[0m%0A[1mmodule.lambda_function.data.aws_caller_identity.current: Refresh complete after 0s [id=350131064538][0m[0m%0A[1mmodule.lambda_layer_s3.data.aws_caller_identity.current: Refresh complete after 0s [id=350131064538][0m[0m%0A[1mmodule.s3_bucket.data.aws_canonical_user_id.this: Refresh complete after 0s [id=c20555c7d3c8cb7cec2fd9dacdea0f908ba112c4d5934db79995f4ddc3c36ede][0m[0m%0A[1mdata.aws_organizations_organization.this: Refresh complete after 0s [id=o-w0iv42zpgi][0m[0m%0A[1mmodule.lambda.aws_lambda_function.this: Drift detected (update)[0m[0m%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  [32m+[0m create[0m%0A  [31m-[0m destroy[0m%0A [36m<=[0m read (data resources)[0m%0A%0ATerraform will perform the following actions:%0A%0A[1m  # random_pet.this[0m will be created%0A[0m  [32m+[0m[0m resource "random_pet" "this" {%0A      [32m+[0m[0m id        = (known after apply)%0A      [32m+[0m[0m length    = 2%0A      [32m+[0m[0m separator = "-"%0A    }%0A%0A[1m  # module.lambda.aws_lambda_function.this[0m will be [1m[31mdestroyed[0m%0A[0m  [31m-[0m[0m resource "aws_lambda_function" "this" {%0A      [31m-[0m[0m architectures                  = [%0A          [31m-[0m[0m "x86_64",%0A        ] [90m-> null[0m[0m%0A      [31m-[0m[0m arn                            = "arn:aws:lambda:us-east-1:350131064538:function:lambda_function_name" [90m-> null[0m[0m%0A      [31m-[0m[0m filename                       = "dist.zip" [90m-> null[0m[0m%0A      [31m-[0m[0m function_name                  = "lambda_function_name" [90m-> null[0m[0m%0A      [31m-[0m[0m handler                        = "dist/lambda" [90m-> null[0m[0m%0A      [31m-[0m[0m id                             = "lambda_function_name" [90m-> null[0m[0m%0A      [31m-[0m[0m invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:lambda_function_name/invocations" [90m-> null[0m[0m%0A      [31m-[0m[0m last_modified                  = "2023-08-01T23:54:01.608+0000" [90m-> null[0m[0m%0A      [31m-[0m[0m layers                         = [] [90m-> null[0m[0m%0A      [31m-[0m[0m memory_size                    = 128 [90m-> null[0m[0m%0A      [31m-[0m[0m package_type                   = "Zip" [90m-> null[0m[0m%0A      [31m-[0m[0m publish                        = false [90m-> null[0m[0m%0A      [31m-[0m[0m qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:lambda_function_name:$LATEST" [90m-> null[0m[0m%0A      [31m-[0m[0m qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:lambda_function_name:$LATEST/invocations" [90m-> null[0m[0m%0A      [31m-[0m[0m reserved_concurrent_executions = -1 [90m-> null[0m[0m%0A      [31m-[0m[0m role                           = "arn:aws:iam::350131064538:role/service-role/cataprato-role-0cqzd0zs" [90m-> null[0m[0m%0A      [31m-[0m[0m runtime                        = "nodejs18.x" [90m-> null[0m[0m%0A      [31m-[0m[0m skip_destroy                   = false [90m-> null[0m[0m%0A      [31m-[0m[0m source_code_hash               = "z62MskzEmjQL5by6KnALmCUBjKmLlhoNG718aWGySk4=" [90m-> null[0m[0m%0A      [31m-[0m[0m source_code_size               = 2125 [90m-> null[0m[0m%0A      [31m-[0m[0m tags                           = {} [90m-> null[0m[0m%0A      [31m-[0m[0m tags_all                       = {} [90m-> null[0m[0m%0A      [31m-[0m[0m timeout                        = 3 [90m-> null[0m[0m%0A      [31m-[0m[0m version                        = "$LATEST" [90m-> null[0m[0m%0A%0A      [31m-[0m[0m ephemeral_storage {%0A          [31m-[0m[0m size = 512 [90m-> null[0m[0m%0A        }%0A%0A      [31m-[0m[0m tracing_config {%0A          [31m-[0m[0m mode = "PassThrough" [90m-> null[0m[0m%0A        }%0A    }%0A%0A[1m  # module.lambda_function.data.aws_iam_policy_document.logs[0][0m will be read during apply%0A[0m [36m<=[0m[0m data "aws_iam_policy_document" "logs" {%0A      [32m+[0m[0m id   = (known after apply)%0A      [32m+[0m[0m json = (known after apply)%0A%0A      [32m+[0m[0m statement {%0A          [32m+[0m[0m actions   = [%0A              [32m+[0m[0m "logs:CreateLogGroup",%0A              [32m+[0m[0m "logs:CreateLogStream",%0A              [32m+[0m[0m "logs:PutLogEvents",%0A            ]%0A          [32m+[0m[0m effect    = "Allow"%0A          [32m+[0m[0m resources = (known after apply)%0A        }%0A    }%0A%0A[1m  # module.lambda_function.aws_cloudwatch_log_group.lambda[0][0m will be created%0A[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "lambda" {%0A      [32m+[0m[0m arn               = (known after apply)%0A      [32m+[0m[0m id                = (known after apply)%0A      [32m+[0m[0m name              = "/aws/lambda/cataprato-core-lambda"%0A      [32m+[0m[0m name_prefix       = (known after apply)%0A      [32m+[0m[0m retention_in_days = 0%0A      [32m+[0m[0m skip_destroy      = false%0A      [32m+[0m[0m tags_all          = (known after apply)%0A    }%0A%0A[1m  # module.lambda_function.aws_iam_policy.logs[0][0m will be created%0A[0m  [32m+[0m[0m resource "aws_iam_policy" "logs" {%0A      [32m+[0m[0m arn         = (known after apply)%0A      [32m+[0m[0m id          = (known after apply)%0A      [32m+[0m[0m name        = "cataprato-core-lambda-logs"%0A      [32m+[0m[0m name_prefix = (known after apply)%0A      [32m+[0m[0m path        = "/tf-managed/"%0A      [32m+[0m[0m policy      = (known after apply)%0A      [32m+[0m[0m policy_id   = (known after apply)%0A      [32m+[0m[0m tags_all    = (known after apply)%0A    }%0A%0A[1m  # module.lambda_function.aws_iam_role.lambda[0][0m will be created%0A[0m  [32m+[0m[0m resource "aws_iam_role" "lambda" {%0A      [32m+[0m[0m arn                   = (known after apply)%0A      [32m+[0m[0m assume_role_policy    = jsonencode(%0A            {%0A              [32m+[0m[0m Statement = [%0A                  [32m+[0m[0m {%0A                      [32m+[0m[0m Action    = "sts:AssumeRole"%0A                      [32m+[0m[0m Effect    = "Allow"%0A                      [32m+[0m[0m Principal = {%0A                          [32m+[0m[0m Service = "lambda.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              [32m+[0m[0m Version   = "2012-10-17"%0A            }%0A        )%0A      [32m+[0m[0m create_date           = (known after apply)%0A      [32m+[0m[0m force_detach_policies = true%0A      [32m+[0m[0m id                    = (known after apply)%0A      [32m+[0m[0m managed_policy_arns   = (known after apply)%0A      [32m+[0m[0m max_session_duration  = 3600%0A      [32m+[0m[0m name                  = "cataprato-core-lambda"%0A      [32m+[0m[0m name_prefix           = (known after apply)%0A      [32m+[0m[0m path                  = "/tf-managed/"%0A      [32m+[0m[0m tags_all              = (known after apply)%0A      [32m+[0m[0m unique_id             = (known after apply)%0A    }%0A%0A[1m  # module.lambda_function.aws_iam_role_policy_attachment.logs[0][0m will be created%0A[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "logs" {%0A      [32m+[0m[0m id         = (known after apply)%0A      [32m+[0m[0m policy_arn = (known after apply)%0A      [32m+[0m[0m role       = "cataprato-core-lambda"%0A    }%0A%0A[1m  # module.lambda_function.aws_lambda_function.this[0][0m will be created%0A[0m  [32m+[0m[0m resource "aws_lambda_function" "this" {%0A      [32m+[0m[0m architectures                  = [%0A          [32m+[0m[0m "x86_64",%0A        ]%0A      [32m+[0m[0m arn                            = (known after apply)%0A      [32m+[0m[0m description                    = "Cataprato core"%0A      [32m+[0m[0m function_name                  = "cataprato-core-lambda"%0A      [32m+[0m[0m handler                        = "lambda.handler"%0A      [32m+[0m[0m id                             = (known after apply)%0A      [32m+[0m[0m invoke_arn                     = (known after apply)%0A      [32m+[0m[0m last_modified                  = (known after apply)%0A      [32m+[0m[0m layers                         = (known after apply)%0A      [32m+[0m[0m memory_size                    = 128%0A      [32m+[0m[0m package_type                   = "Zip"%0A      [32m+[0m[0m publish                        = true%0A      [32m+[0m[0m qualified_arn                  = (known after apply)%0A      [32m+[0m[0m qualified_invoke_arn           = (known after apply)%0A      [32m+[0m[0m reserved_concurrent_executions = -1%0A      [32m+[0m[0m role                           = (known after apply)%0A      [32m+[0m[0m runtime                        = "nodejs18.x"%0A      [32m+[0m[0m s3_bucket                      = (known after apply)%0A      [32m+[0m[0m s3_key                         = "lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"%0A      [32m+[0m[0m s3_object_version              = (known after apply)%0A      [32m+[0m[0m signing_job_arn                = (known after apply)%0A      [32m+[0m[0m signing_profile_version_arn    = (known after apply)%0A      [32m+[0m[0m skip_destroy                   = false%0A      [32m+[0m[0m source_code_hash               = (known after apply)%0A      [32m+[0m[0m source_code_size               = (known after apply)%0A      [32m+[0m[0m tags_all                       = (known after apply)%0A      [32m+[0m[0m timeout                        = 3%0A      [32m+[0m[0m version                        = (known after apply)%0A%0A      [32m+[0m[0m ephemeral_storage {%0A          [32m+[0m[0m size = 512%0A        }%0A%0A      [32m+[0m[0m timeouts {%0A          [32m+[0m[0m create = "20m"%0A          [32m+[0m[0m delete = "20m"%0A          [32m+[0m[0m update = "20m"%0A        }%0A    }%0A%0A[1m  # module.lambda_function.aws_lambda_function_url.this[0][0m will be created%0A[0m  [32m+[0m[0m resource "aws_lambda_function_url" "this" {%0A      [32m+[0m[0m authorization_type = "AWS_IAM"%0A      [32m+[0m[0m function_arn       = (known after apply)%0A      [32m+[0m[0m function_name      = "cataprato-core-lambda"%0A      [32m+[0m[0m function_url       = (known after apply)%0A      [32m+[0m[0m id                 = (known after apply)%0A      [32m+[0m[0m invoke_mode        = "RESPONSE_STREAM"%0A      [32m+[0m[0m url_id             = (known after apply)%0A%0A      [32m+[0m[0m cors {%0A          [32m+[0m[0m allow_credentials = true%0A          [32m+[0m[0m allow_headers     = [%0A              [32m+[0m[0m "date",%0A              [32m+[0m[0m "keep-alive",%0A            ]%0A          [32m+[0m[0m allow_methods     = [%0A              [32m+[0m[0m "*",%0A            ]%0A          [32m+[0m[0m allow_origins     = [%0A              [32m+[0m[0m "*",%0A            ]%0A          [32m+[0m[0m expose_headers    = [%0A              [32m+[0m[0m "date",%0A              [32m+[0m[0m "keep-alive",%0A            ]%0A          [32m+[0m[0m max_age           = 86400%0A        }%0A    }%0A%0A[1m  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"][0m will be created%0A[0m  [32m+[0m[0m resource "aws_lambda_permission" "current_version_triggers" {%0A      [32m+[0m[0m action              = "lambda:InvokeFunction"%0A      [32m+[0m[0m function_name       = "cataprato-core-lambda"%0A      [32m+[0m[0m id                  = (known after apply)%0A      [32m+[0m[0m principal           = "apigateway.amazonaws.com"%0A      [32m+[0m[0m qualifier           = (known after apply)%0A      [32m+[0m[0m source_arn          = "arn:aws:execute-api:us-east-1:350131064538:aqnku8akd0/*/*/*"%0A      [32m+[0m[0m statement_id        = "APIGatewayAny"%0A      [32m+[0m[0m statement_id_prefix = (known after apply)%0A    }%0A%0A[1m  # module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["APIGatewayAny"][0m will be created%0A[0m  [32m+[0m[0m resource "aws_lambda_permission" "unqualified_alias_triggers" {%0A      [32m+[0m[0m action              = "lambda:InvokeFunction"%0A      [32m+[0m[0m function_name       = "cataprato-core-lambda"%0A      [32m+[0m[0m id                  = (known after apply)%0A      [32m+[0m[0m principal           = "apigateway.amazonaws.com"%0A      [32m+[0m[0m source_arn          = "arn:aws:execute-api:us-east-1:350131064538:aqnku8akd0/*/*/*"%0A      [32m+[0m[0m statement_id        = "APIGatewayAny"%0A      [32m+[0m[0m statement_id_prefix = (known after apply)%0A    }%0A%0A[1m  # module.lambda_function.aws_s3_object.lambda_package[0][0m will be created%0A[0m  [32m+[0m[0m resource "aws_s3_object" "lambda_package" {%0A      [32m+[0m[0m acl                    = "private"%0A      [32m+[0m[0m bucket                 = (known after apply)%0A      [32m+[0m[0m bucket_key_enabled     = (known after apply)%0A      [32m+[0m[0m content_type           = (known after apply)%0A      [32m+[0m[0m etag                   = (known after apply)%0A      [32m+[0m[0m force_destroy          = false%0A      [32m+[0m[0m id                     = (known after apply)%0A      [32m+[0m[0m key                    = "lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"%0A      [32m+[0m[0m kms_key_id             = (known after apply)%0A      [32m+[0m[0m server_side_encryption = (known after apply)%0A      [32m+[0m[0m source                 = "./.terraform/lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"%0A      [32m+[0m[0m storage_class          = "ONEZONE_IA"%0A      [32m+[0m[0m tags_all               = (known after apply)%0A      [32m+[0m[0m version_id             = (known after apply)%0A    }%0A%0A[1m  # module.lambda_function.local_file.archive_plan[0][0m will be created%0A[0m  [32m+[0m[0m resource "local_file" "archive_plan" {%0A      [32m+[0m[0m content              = jsonencode(%0A            {%0A              [32m+[0m[0m artifacts_dir = "./.terraform/lambda-builds/"%0A              [32m+[0m[0m build_plan    = [%0A                  [32m+[0m[0m [%0A                      [32m+[0m[0m "zip",%0A                      [32m+[0m[0m "./dist/lambda.js",%0A                      [32m+[0m[0m [90mnull[0m[0m,%0A                    ],%0A                ]%0A              [32m+[0m[0m filename      = "./.terraform/lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"%0A              [32m+[0m[0m runtime       = "nodejs18.x"%0A            }%0A        )%0A      [32m+[0m[0m content_base64sha256 = (known after apply)%0A      [32m+[0m[0m content_base64sha512 = (known after apply)%0A      [32m+[0m[0m content_md5          = (known after apply)%0A      [32m+[0m[0m content_sha1         = (known after apply)%0A      [32m+[0m[0m content_sha256       = (known after apply)%0A      [32m+[0m[0m content_sha512       = (known after apply)%0A      [32m+[0m[0m directory_permission = "0755"%0A      [32m+[0m[0m file_permission      = "0644"%0A      [32m+[0m[0m filename             = "./.terraform/lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.plan.json"%0A      [32m+[0m[0m id                   = (known after apply)%0A    }%0A%0A[1m  # module.lambda_function.null_resource.archive[0][0m will be created%0A[0m  [32m+[0m[0m resource "null_resource" "archive" {%0A      [32m+[0m[0m id       = (known after apply)%0A      [32m+[0m[0m triggers = {%0A          [32m+[0m[0m "filename"  = "./.terraform/lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"%0A          [32m+[0m[0m "timestamp" = "1691190368371745200"%0A        }%0A    }%0A%0A[1m  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0][0m will be created%0A[0m  [32m+[0m[0m resource "null_resource" "sam_metadata_aws_lambda_function" {%0A      [32m+[0m[0m id       = (known after apply)%0A      [32m+[0m[0m triggers = {%0A          [32m+[0m[0m "built_output_path"    = "./.terraform/lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"%0A          [32m+[0m[0m "original_source_code" = ""./dist/lambda.js""%0A          [32m+[0m[0m "resource_name"        = "aws_lambda_function.this[0]"%0A          [32m+[0m[0m "resource_type"        = "ZIP_LAMBDA_FUNCTION"%0A          [32m+[0m[0m "source_code_property" = "path"%0A        }%0A    }%0A%0A[1m  # module.lambda_layer_s3.aws_lambda_layer_version.this[0][0m will be created%0A[0m  [32m+[0m[0m resource "aws_lambda_layer_version" "this" {%0A      [32m+[0m[0m arn                         = (known after apply)%0A      [32m+[0m[0m compatible_runtimes         = [%0A          [32m+[0m[0m "nodejs18.x",%0A        ]%0A      [32m+[0m[0m created_date                = (known after apply)%0A      [32m+[0m[0m description                 = "Node_modules layer"%0A      [32m+[0m[0m id                          = (known after apply)%0A      [32m+[0m[0m layer_arn                   = (known after apply)%0A      [32m+[0m[0m layer_name                  = "cataprato-core-layer-s3"%0A      [32m+[0m[0m s3_bucket                   = (known after apply)%0A      [32m+[0m[0m s3_key                      = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"%0A      [32m+[0m[0m s3_object_version           = (known after apply)%0A      [32m+[0m[0m signing_job_arn             = (known after apply)%0A      [32m+[0m[0m signing_profile_version_arn = (known after apply)%0A      [32m+[0m[0m skip_destroy                = false%0A      [32m+[0m[0m source_code_hash            = (known after apply)%0A      [32m+[0m[0m source_code_size            = (known after apply)%0A      [32m+[0m[0m version                     = (known after apply)%0A    }%0A%0A[1m  # module.lambda_layer_s3.aws_s3_object.lambda_package[0][0m will be created%0A[0m  [32m+[0m[0m resource "aws_s3_object" "lambda_package" {%0A      [32m+[0m[0m acl                    = "private"%0A      [32m+[0m[0m bucket                 = (known after apply)%0A      [32m+[0m[0m bucket_key_enabled     = (known after apply)%0A      [32m+[0m[0m content_type           = (known after apply)%0A      [32m+[0m[0m etag                   = (known after apply)%0A      [32m+[0m[0m force_destroy          = false%0A      [32m+[0m[0m id                     = (known after apply)%0A      [32m+[0m[0m key                    = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"%0A      [32m+[0m[0m kms_key_id             = (known after apply)%0A      [32m+[0m[0m server_side_encryption = (known after apply)%0A      [32m+[0m[0m source                 = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"%0A      [32m+[0m[0m storage_class          = "ONEZONE_IA"%0A      [32m+[0m[0m tags_all               = (known after apply)%0A      [32m+[0m[0m version_id             = (known after apply)%0A    }%0A%0A[1m  # module.lambda_layer_s3.local_file.archive_plan[0][0m will be created%0A[0m  [32m+[0m[0m resource "local_file" "archive_plan" {%0A      [32m+[0m[0m content              = jsonencode(%0A            {%0A              [32m+[0m[0m artifacts_dir = "builds"%0A              [32m+[0m[0m build_plan    = [%0A                  [32m+[0m[0m [%0A                      [32m+[0m[0m "zip",%0A                      [32m+[0m[0m "./dist",%0A                      [32m+[0m[0m [90mnull[0m[0m,%0A                    ],%0A                ]%0A              [32m+[0m[0m filename      = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"%0A              [32m+[0m[0m runtime       = ""%0A            }%0A        )%0A      [32m+[0m[0m content_base64sha256 = (known after apply)%0A      [32m+[0m[0m content_base64sha512 = (known after apply)%0A      [32m+[0m[0m content_md5          = (known after apply)%0A      [32m+[0m[0m content_sha1         = (known after apply)%0A      [32m+[0m[0m content_sha256       = (known after apply)%0A      [32m+[0m[0m content_sha512       = (known after apply)%0A      [32m+[0m[0m directory_permission = "0755"%0A      [32m+[0m[0m file_permission      = "0644"%0A      [32m+[0m[0m filename             = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.plan.json"%0A      [32m+[0m[0m id                   = (known after apply)%0A    }%0A%0A[1m  # module.lambda_layer_s3.null_resource.archive[0][0m will be created%0A[0m  [32m+[0m[0m resource "null_resource" "archive" {%0A      [32m+[0m[0m id       = (known after apply)%0A      [32m+[0m[0m triggers = {%0A          [32m+[0m[0m "filename"  = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"%0A          [32m+[0m[0m "timestamp" = "1691190368389314800"%0A        }%0A    }%0A%0A[1m  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0][0m will be created%0A[0m  [32m+[0m[0m resource "null_resource" "sam_metadata_aws_lambda_layer_version" {%0A      [32m+[0m[0m id       = (known after apply)%0A      [32m+[0m[0m triggers = {%0A          [32m+[0m[0m "built_output_path"    = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"%0A          [32m+[0m[0m "original_source_code" = ""./dist""%0A          [32m+[0m[0m "resource_name"        = "aws_lambda_layer_version.this[0]"%0A          [32m+[0m[0m "resource_type"        = "LAMBDA_LAYER"%0A          [32m+[0m[0m "source_code_property" = "path"%0A        }%0A    }%0A%0A[1m  # module.s3_bucket.aws_s3_bucket.this[0][0m will be created%0A[0m  [32m+[0m[0m resource "aws_s3_bucket" "this" {%0A      [32m+[0m[0m acceleration_status         = (known after apply)%0A      [32m+[0m[0m acl                         = (known after apply)%0A      [32m+[0m[0m arn                         = (known after apply)%0A      [32m+[0m[0m bucket                      = (known after apply)%0A      [32m+[0m[0m bucket_domain_name          = (known after apply)%0A      [32m+[0m[0m bucket_prefix               = (known after apply)%0A      [32m+[0m[0m bucket_regional_domain_name = (known after apply)%0A      [32m+[0m[0m force_destroy               = true%0A      [32m+[0m[0m hosted_zone_id              = (known after apply)%0A      [32m+[0m[0m id                          = (known after apply)%0A      [32m+[0m[0m object_lock_enabled         = false%0A      [32m+[0m[0m policy                      = (known after apply)%0A      [32m+[0m[0m region                      = (known after apply)%0A      [32m+[0m[0m request_payer               = (known after apply)%0A      [32m+[0m[0m tags_all                    = (known after apply)%0A      [32m+[0m[0m website_domain              = (known after apply)%0A      [32m+[0m[0m website_endpoint            = (known after apply)%0A    }%0A%0A[1m  # module.s3_bucket.aws_s3_bucket_public_access_block.this[0][0m will be created%0A[0m  [32m+[0m[0m resource "aws_s3_bucket_public_access_block" "this" {%0A      [32m+[0m[0m block_public_acls       = true%0A      [32m+[0m[0m block_public_policy     = true%0A      [32m+[0m[0m bucket                  = (known after apply)%0A      [32m+[0m[0m id                      = (known after apply)%0A      [32m+[0m[0m ignore_public_acls      = true%0A      [32m+[0m[0m restrict_public_buckets = true%0A    }%0A%0A[1m  # module.s3_bucket.aws_s3_bucket_versioning.this[0][0m will be created%0A[0m  [32m+[0m[0m resource "aws_s3_bucket_versioning" "this" {%0A      [32m+[0m[0m bucket = (known after apply)%0A      [32m+[0m[0m id     = (known after apply)%0A%0A      [32m+[0m[0m versioning_configuration {%0A          [32m+[0m[0m mfa_delete = (known after apply)%0A          [32m+[0m[0m status     = "Enabled"%0A        }%0A    }%0A%0A[1mPlan:[0m 21 to add, 0 to change, 1 to destroy.%0A[0m%0A------------------------------------------------------------------------%0A%0A[1mCost Estimation:%0A[0m%0AResources: 0 of 6 estimated%0A           $0.0/mo +$0.0%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
*Pushed by: @filipezz, Action: `pull_request`*